#+STARTUP: overview hidestars logdone
#+OPTIONS: tags:t timestamp:t p:t todo:t TeX:t
# #Do the right thing automatically (MathJax)
#+OPTIONS: LaTeX:t          
#+OPTIONS: skip:t @:t ::t |:t ^:t f:t
#+LANGUAGE: fr
#+OPTIONS: toc:nil h:3
#+PROPERTY: header-args :results output :exports code
#+BEGIN_export markdown
---
layout: page-fullwidth
#
# Content
#
subheadline: "UCAnCODE"
title: "Tutoriel UCAnCODE"
teaser: "Pour cette 2ème participation au Google HashCode, le hub UFR Sciences a réuni 79 participants répartis en 29 équipes qui ont contribué à placer la France à la première place dans le classement par pays."
categories:
  - UCAnCODE
tags:
  - NEWS
#
# Styling
#
image:
  header: "header-merci.jpg"
  thumb: "hashcode-hash.jpg"
  homepage: "header-merci.jpg"
  caption: ""
  url: ""
header:
  image_fullwidth: "header-merci.jpg"
---
#+END_export

*** Dans le langage Python 3
    #+BEGIN_SRC sh :session tuto
      python3 ECHO.py < ECHO-03.in
    #+END_SRC

    #+RESULTS:
    : 4
    : 5
    : 6

    La commande ~python3~ permet d'interpréter le script ~ECHO.py~.
*** Dans le langage R
     #+BEGIN_SRC sh :session tuto
       Rscript ECHO.R < ECHO-03.in
     #+END_SRC

     #+RESULTS:
     La commande ~Rscript~ permet d'interpréter le script ~ECHO.R~.
*** Dans un terminal powershell sous WINDOWS

    L'opérateur de redirection ~<~ n'existe pas encore dans powershell. 
    Il faut donc utiliser une commande équivalente combinant la commande ~cat~ et un tube (/pipe/ en anglais).
    
    Par exemple, pour tester un programme en python 3, il faudra taper la commande suivante : 
   #+BEGIN_SRC bash :exports none :results none :session tuto
    cat ECHO-03.in | python3 ECHO.py
   #+END_SRC
   
    #+RESULTS:
    : 4
    : 5
    : 6
